/* ----------<문제 정의>----------
문제: N!결과값에서 0의 개수
입력: N(최대 500)
출력: 0의 개수
주의 사항: 큰 입력에 따라 N! 연산하면서 overflow 발생
관련 문제: baekjoon/10872/팩토리얼
*/
/* ----------<알고리즘>----------
int는 N이 12까지 허용(12!은 4억)
500 정도면 다른 자료형 범위도 초과

0을 만드는 10의 인수가 몇 개가 들어가는지 파악
2*5=10. 한가지 경우 밖에 존재하지 않으므로 1~N 까지 2와 5가 각각 몇개가 들어가는지 파악하고
최종적으로 둘 중에 작은 개수를 선택(반드시 쌍으로 이루어져야만 10이 되므로)
*/
#include <iostream>
#include <algorithm>
using namespace std;
int main(){
    int n;
    int n2 = 0, n5 = 0;
    int temp;
    cin >> n;
    for(int i = 2; i <= n; i++){
        // 2로 나누어 떨어지는지 확인
        temp = i;
        while(temp % 2 == 0){
            n2++;
            temp/=2;     
        }
        // 5로 나누어 떨어지는지 확인
        temp = i;
        while(temp % 5 == 0){
            n5++;
            temp/=5;     
        }
    }
    n2 > n5 ? cout << n5 : cout << n2;
}