/* ----------<문제 정의>----------
문제: 한정단 문자로 최대한 많이 읽을 수 있는 단어의 개수 찾기
입력: 단어의 개수 N(최대 50), 가르치는 문자 K(최대 26, 최소 0), N개의 문자열
출력: 최대한 많이 읽을 수 있는 단어의 수
*/
/* ----------<틀린 접근법>----------
남극 단어는 무조건 anta와 tica로 시작되고 끝난다.
무조건 한 단어를 읽으려면 최소한 a,n,t,c,i 다섯 문자는 알아야 한다.
이외에 가장 많이 겹치는 문자를 찾아야 한다.
각 문자의 개수를 파악하기 위해서 맵을 사용하거나 알파벳 순서의 배열을 이용한다.
이 값을 기준으로 내림차순으로 정렬하여 가장 최댓값을 출력한다.

?이때 한 문자를 읽었다고해서 그 문장 전체를 읽었다는 의미는 될 수 없다.
-> 그래서 조합으로 구성하여 확인해야 한다.

?단, k는 5미만이면 0을 출력하고
5이상이더라도 k-5개만 추가적으로 읽을 수 있다.
즉 a,n,t,c,i 외에 새로운 문자는 k-5 소모해야 하므로 이 수를 초과할 수 없다.
-> 제한 조건으로 도입부에 코드를 추가한다.
*/
