/* ----------<문제 정의>----------
문제: 브루트포스
입력: 지구, 해, 달(15 * 28 * 19)
출력: 날짜 계산 결과 값
*/
/* ----------<접근법>----------
규칙성을 못 찾겠음
일일이 수를 높여가면서 확인
*/
/* ----<알고리즘>----
while(1)
    3개 원소 1씩 증가 및 초기화
    3개 원소 모두 일치하는지 확인(나머지 연산 사용)
        ❗나머지 연산을 사용하면 수 표현 범위가 달라짐
        
이 풀이 방법의 시간 복잡도는 E S M 연도의 모든 경우를 다 구해보는 것일 것이다. 
e, s, m이라는 각각의 변수를 두고 각각 증가시키면 되기때문에 시간복잡도는 O(N)이다. 
그리고 E S M 연도를 모두 구해보는 경우의 수는 15 x 28 x 19 = 7,980이다.
*/
/* -----<반례>-----
❗나머지 연산을 사용하면 수 표현 범위가 달라짐
지구의 경우 1~15를 표현해야하는데, 0~15를 표현하게 됨
    1 1 1 부터 15 15 15 까지는 괜찮음
    16을 나타내는 1 16 16에서 내 코드는 0 16 16이 됨
    20을 나타내는 5 20 19에서 내 코드는 4 20 0이 됨
*/
#include <iostream>
using namespace std;
int main(){
    int a[3] = {0,};
    int b[3];
    bool comp = false;
    int cnt = 1;
    for(int i = 0; i < 3; i++){
        cin >> b[i];
    }
    while(1){
        a[0]++; a[1]++; a[2]++;       
        if(a[0] % 16 == b[0] && a[1] % 29 == b[1] && a[2] % 20 == b[2]){ // 15 28 19 인 이유
            cout << cnt;
            return 0;
        }
        cnt++;
    }
}