/* ----------<문제 정의>----------
문제: 2차원 배열 세로 읽기
입력: 2차원 배열(총 다섯 줄, 각 줄에 최대 15개 문자)
*/
/* ----------<접근법>----------
컴퓨터 입력은 가로 줄 단위이므로 별도의 공간에 저장해야 한다.
입력을 가로줄마다 어떤 길이의 문자열이 들어올 지 모른다.
그래서 char 타입의 2차원 배열이 아닌 string 타입의 1차원 배열을 선언할 것이다.
공백을 제외하고 모든 세로줄을 왼쪽에서 오른쪽순으로 출력한다.
공백이 중간에 크게 있고 달랑 하나 동떨어져 있는 케이스도 있을 수 있으므로 세로 5줄, 가로 15줄을 모두 순회해야 한다.
이때 문자열을 초과하는 범위에 잘못된 접근하지 않도록 주의해야 한다.
모든 문자열이 같은 위치에 널문자가 존재하는 게 아니므로 해당되는 가로줄의 문자열 길이 내에 있는지 확인한다.
*/
#include <iostream>
#include <string>
using namespace std;
int main(){
    string s[5];
    //5줄 입력
    for(int i = 0; i < 5; i++){
        cin >> s[i];
    }
    for(int i = 0; i < 15; i++){
        for(int j = 0; j < 5; j ++){
            if(i < s[j].length() && s[j][i]!=' ') cout << s[j][i];
        }
    }
}