/* ----------<문제 정의>----------
문제: 2007년 x월 y일의 요일 알아내기
힌트: 1,3,5,7,8,10,12월은 31일까지, 4,6,9,11월은 30일까지, 2월은 28일까지 있다.
*/
/* ----------<접근법>----------
x월 y일은
x-1월까지 모든 원소합을 구한다.
y일을 더한다.
7로 나눈다.(0~6의 값을 갖는다.)
1을 빼준다. (1일부터 시작하므로)
음수이면 6으로 바꿔준다.
해당 인덱스로 요일을 출력한다.
*/
#include <iostream>
using namespace std;
int main(){
    int numday[12] = {31,28,31,30,31,30,31,31,30,31,30,31};
    string week[7] = {"MON", "TUE", "WED", "THU", "FRI", "SAT", "SUN"};
    int x, y, day = 0;
    cin >> x >> y;
    // x-1월까지 모든 원소합을 구한다.
    for(int i = 0 ; i < x-1; i++){
        day+=numday[i];
    }
    day+= y;
    day%=7;
    day = day - 1; // 1일부터 시작하므로 기간을 나타내기 위해 1을 빼준다.
    if (day < 0) day = 6;
    cout << week[day];
}